/* 
  탐욕 알고리즘 (Greedy Algorithm)
    - 현재 상황에서 당장 가장 좋아 보이는 상황만을 선택하는 알고리즘이다.
    - 흔히 그리디 알고리즘, 혹은 탐욕법이라고 불리기도 한다.
    - 최적의 해를 구하기 위한 근사적인 방법으로 사용될 때가 많다.

  탐욕 알고리즘과 근사 해
    - 현실 세계의 많은 상황에서는, 단순한 탐욕 알고리즘으로는 최적의 해를 놓칠 수 있다.
    - 하지만, 최적의 해에 가까운 답을 뱉는 것을 고려하면 현실에서의 다양한 프로그램에서 "근사 해"를 구하는 목적으로 사용되곤 한다.
    
  코딩 테스트에서의 탐욕 알고리즘
    - 일반적인 채점 시스템은 시험 참가자의 코드 결과가 정해진 결과와 같은지 확인한다.
    - 코딩 테스트에서 탐욕 알고리즘 문제가 출제되는 경우를 생각해 보자.
    - 일반적으로 탐욕 알고리즘 유형에서는, 탐욕 방법으로 최적의 해가 보장되는 문제가 출제된다.

  탐욕 알고리즘의 접근 방법
    - 탐욕 알고리즘 문제를 해결할 때는 일반적으로 다음의 과정을 거친다.
      1. 방법 고안하기: 현재 상황에서 어떤 것을 선택할지 알고리즘을 고안한다.
      2. 정당성 확인하기: 자신이 고안한 알고리즘이 항상 최적의 해를 보장하는지 확인한다. (증명 단계)
*/
